# Используем официальный легкий образ Python
FROM python:3.11-slim-bookworm

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем файл с зависимостями в первую очередь
# Это позволяет Docker кэшировать этот слой и не переустанавливать зависимости при каждом изменении кода
COPY requirements.txt .

# Устанавливаем зависимости
RUN pip install --no-cache-dir -r requirements.txt

# Копируем весь остальной код проекта в рабочую директорию
COPY . .

# Создаем директорию для базы данных
RUN mkdir -p data

# Указываем команду для запуска приложения при старте контейнера
CMD ["python", "-m", "app.main"]