# Список предсказаний. Можете добавить свои!
FORTUNES = [
    "Сегодня идеальный день для новых начинаний!",
    "Вас ждет приятная неожиданность во второй половине дня.",
    "Остерегайтесь людей в желтом. Возможно.",
    "Звезды советуют вам сегодня пить больше воды.",
    "Ваша упорная работа скоро принесет плоды. Очень скоро.",
    "Сегодняшний день лучше посвятить планированию, а не действиям.",
    "Вас ждет финансовая удача! Проверьте лотерейный билет.",
    "Не бойтесь сделать первый шаг. Риск оправдан.",
    "Ответ на главный вопрос вы найдете в неожиданном месте.",
    "Отличный день для обучения и получения новых навыков."
]